<?php

// +----------------------------------------------------------------------
// | ThinkAdmin
// +----------------------------------------------------------------------
// | 版权所有 2014~2017 广州楚才信息科技有限公司 [ http://www.cuci.cc ]
// +----------------------------------------------------------------------
// | 官方网站: http://think.ctolog.com
// +----------------------------------------------------------------------
// | 开源协议 ( https://mit-license.org )
// +----------------------------------------------------------------------
// | github开源项目：https://github.com/zoujingli/ThinkAdmin
// +----------------------------------------------------------------------
$cache_path =   env('runtime_path').'cache';
file_exists($cache_path) || mkdir($cache_path, 0777, true);
//return  [
//    // 缓存类型为File
//    'type'  =>  'File',
//    // 缓存有效期为永久有效
//    'expire'=>  0,
//    //缓存前缀
//    'prefix'=>  'think',
//     // 指定缓存目录
//    'path'  =>  $cache_path,
//];
return   [
    // 使用复合缓存类型
    'type'  =>  'complex',
    // 默认使用的缓存
    'default'   =>  [
        // 驱动方式
        'type'   => 'File',
        // 缓存保存目录
        'path'   => $cache_path,
        'expire'=>  0,
    //缓存前缀
       'prefix'=>  'think',
    ],
//    // 文件缓存
//    'file'   =>  [
//        // 驱动方式
//        'type'   => 'file',
//        // 设置不同的缓存保存目录
//        'path'   => RUNTIME_PATH . 'file/',
//    ],
    // redis缓存
    'redis'   =>  [
        // 驱动方式
        'type'   => 'redis',
        // 服务器地址
        'host'   => '127.0.0.1',  //redis服务器ip

        'port'   => '6379',
        'password' => '',
        'timeout'=> 3600*24,
        // 缓存有效期 0表示永久缓存

        'expire' => 3600*48,
    ],
];