<?php

// +----------------------------------------------------------------------
// | ThinkAdmin
// +----------------------------------------------------------------------
// | 版权所有 2014~2017 广州楚才信息科技有限公司 [ http://www.cuci.cc ]
// +----------------------------------------------------------------------
// | 官方网站: http://think.ctolog.com
// +----------------------------------------------------------------------
// | 开源协议 ( https://mit-license.org )
// +----------------------------------------------------------------------
// | github开源项目：https://github.com/zoujingli/ThinkAdmin
// +----------------------------------------------------------------------

return [
 	'accessKey' => 'J5yTKVGQOcVFhyEDoJB61wN5ro8muoKC8DgdvKr7',
    'secretKey' => 'xALkEd496z-7BlBPKKe-mPGJslG8-zHmKRbjezXX',
    'domain' => 'rs.kami5.com',//域名地址
    'bucket' => 'weiyilove',//空间名称
    'zone'=> 'south_china'//区域

    
    
    
    
];